app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`email`, `password`, `created_at`, `updated_at`) VALUES ('booo', 'osa', '2015-06-20 16:46:24', '2015-06-20 16:46:24')

  def show
    @user = User.find(session[:user_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 0 LIMIT 1